

import './App.css'
import { Header } from './Header/Header'
import { Title } from './Header/HeaderTitle/HeaderTitle';
import { AboutSchool } from './Main/AboutSchool/AboutSchool';
import { Paragraf } from './Main/Components/Paragrafs/Paragrafs';
import { TitleSection } from './Main/Components/TitleSection/TitleSection';
import { Main } from './Main/Main';
import { NavBar } from './NavBar/NavBar'
import { NavButton } from './NavButton/NavButton'
import logo from './images/logo.png';
function App() {


  return (
    <>
      <Header>
        
        <NavBar>
          <NavButton value="Про нас" />
          <NavButton value="Послуги" />
          <NavButton value="Вартість" />
          <NavButton value="Блог" />
          <NavButton value="Команда" />
          <NavButton value="Контакти" />
        </NavBar>

        <Title name={'Wawe'} paragraf={'Школа серфінгу на Канарських островах'} />
      </Header>

     <Main>
      
      <AboutSchool>
        <TitleSection name="ПРО ШКОЛУ, ПРО СЕРФІНГ, ПРО КАНАРИ" />
        <Paragraf text={'Канарські острови не випадково називають європейськими Гавайями – це ідеальне місце для шанувальників серфінгу: стабільний теплий вітер цілий рік, піщані пляжі, кілометри незайманих просторів та прозоре море. А справжньою Меккою для серфінгістів стає Фуертевентура – другий за величиною острів архіпелагу.'}/>
        <Paragraf text={'Саме тут найкраще в Іспанії місце, де можна пройти навчання серфінгу. Крім того, що взимку і восени сюди приходять величезні атлантичні хвилі, Фуертевентура може похвалитися і безліччю мілководних спокійних лагун, які відмінно підходять для навчання серфінгістів-початківців.'}/>
        <Paragraf text={'Серфінг на Канарських островах доступний цілий рік – і хвилі, і слушна погода тут є завжди. Причому хвилю, що підходить за рівнем, зможе знайти і справжній профі, і новачок. Не випадково вважається, що саме це місце найкраще підійде для навчання, тут можливо без труднощів переходити на новий рівень.'}/>
        <Paragraf text={'Перераховуючи переваги, не можна обійти і те, що пляжі Фуертевентури найдовші на Канарах. У результаті неможливо уявити їх переповненими туристами. Ви зіткнетеся тільки з тими, кого, як і вас, цікавитиме одна мета – навчання серфінгу.'}/>
        <Paragraf text={'Поки що ви тільки хочете зрозуміти, що таке серфінг, чи вже випробували всю красу катання на хвилях, але бажаєте підняти свій рівень? Наша школа серфінгу зможе запропонувати навчання для будь-якого рівня підготовки.'}/>
        <Paragraf text={'Чотири години захоплюючих занять на день допоможуть вам впевнено підкорювати хвилі, відчути себе справжнім серфінгістом.'}/>
        <Paragraf text={'Основні переваги нашої російської школи – висока якість викладання та організації занять, безпека (всі наші клієнти застраховані в компанії Allianz), відмінний інвентар та екіпірування (надається на весь курс навчання), у тому числі м\'які безпечні дошки для початківців.'}/>
        <Paragraf text={'Спочатку ми визначаємо рівень катання та фізичної підготовки і лише потім складаємо програму підготовки. І можемо запевнити, що після того, як закінчиться навчання, ви не тільки отримаєте масу чудових відчуттів, але й цей рівень підніметься на новий щабель.'}/>
      </AboutSchool>
     </Main>

    </>
  )
}

export default App
